openfoam/manufacturable_mesh_families/cases/medium/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }

vertices
(
    (-8 -10 -7) (18 -10 -7) (18 10 -7) (-8 10 -7)
    (-8 -10  7) (18 -10  7) (18 10  7) (-8 10  7)
);
blocks (hex (0 1 2 3 4 5 6 7) (64 48 32) simpleGrading (1 1 1));
boundary
(
    inlet { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((2 6 5 1)); }
    farfield { type patch; faces ((3 7 6 2) (1 5 4 0) (0 3 2 1) (4 5 6 7)); }
);
