openfoam/manufacturable_mesh_families/cases/medium/system/snappyHexMeshDict
FoamFile { format ascii; class dictionary; object snappyHexMeshDict; }

castellatedMesh true;
snap true;
addLayers true;

geometry
{
    aircraft
    {
        type triSurface;
        file "CargoUAV_partitioned_m.stl";
        regions
        {
            airframe { name aircraft_airframe; }
            nacelles { name aircraft_nacelles; }
            rotors { name aircraft_rotors; }
            pusher { name aircraft_pusher; }
        }
    }
    nearBody
    {
        type box;
        min (-1 -3 -2);
        max (8 3 2);
    }
}

castellatedMeshControls
{
    maxLocalCells 1500000;
    maxGlobalCells 3000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;

    features
    (
        { file "CargoUAV_partitioned_m.eMesh"; level 5; }
    );

    refinementSurfaces
    {
        aircraft
        {
            level (5 5);
            patchInfo
            {
                type wall;
                inGroups (aircraftGroup);
            }
        }
    }

    resolveFeatureAngle 30;
    refinementRegions
    {
        nearBody
        {
            mode inside;
            level 2;
        }
    }

    locationInMesh (10 0 5);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 15;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        "aircraft_(airframe|nacelles)" { nSurfaceLayers 5; }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.05;
    nGrow 0;
    featureAngle 80;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothSurfaceNormals 3;
    nSmoothNormals 5;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 1;
    nLayerIter 10;
    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"
    relaxed { maxNonOrtho 75; }
}


mergeTolerance 1e-6;
