openfoam/manufacturable_mesh_families/cases/medium/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }

simulationType RAS;
RAS
{
    model       kOmegaSST;
    turbulence  on;
}

