openfoam/manufacturable_mesh_families/cases/medium/0.orig/k
FoamFile { format ascii; class volScalarField; object k; }

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.09375;
boundaryField
{
    inlet       { type fixedValue; value uniform 0.09375; }
    outlet      { type inletOutlet; inletValue uniform 0.09375; value uniform 0.09375; }
    farfield    { type inletOutlet; inletValue uniform 0.09375; value uniform 0.09375; }
    "aircraft_.*" { type kqRWallFunction; value uniform 0.09375; }
}
