openfoam/manufacturable_mesh_families/cases/medium/system/decomposeParDict
FoamFile { format ascii; class dictionary; object decomposeParDict; }

numberOfSubdomains 10;
method scotch;

